[
  {
    "value": "frontend-development",
    "label": "Front-End",
    "image": "../src/assets/tabs/frontend/1.png",
    "title": "Front-End Development",
    "description": "With over three years of professional experience, I build high-performance and user-focused applications using React, Next.js, and modern JavaScript.",
    "points": [
      "Building scalable and interactive user interfaces with React and component libraries.",
      "Developing server-side rendered (SSR) websites with Next.js for enhanced performance and SEO.",
      "Integrating with RESTful and GraphQL APIs to efficiently fetch and send data.",
      "Creating responsive, accessible layouts using modern HTML5, CSS, React Component Libraries."
    ],
    "tech": [
      "React",
      "NextJS",
      "React Native",
      "JavaScript",
      "HTML5",
      "CSS3",
      "REST APIs",
      "Mantine"
    ]
  },
  {
    "value": "backend-databases",
    "label": "Back-End",
    "image": "../src/assets/tabs/backend/3.png",
    "title": "Back-End & Databases",
    "description": "I build the engines that power applications, from scalable server logic to efficient data storage solutions.",
    "points": [
      "Designing and developing robust RESTful and GraphQL APIs with Node.js.",
      "Implementing secure user authentication and authorization systems.",
      "Modeling and managing both SQL and NoSQL databases for optimal performance.",
      "Writing clean, efficient server-side logic to power application features."
    ],
    "tech": [
      "Node.js",
      "Express",
      "Python",
      "PostgreSQL",
      "MongoDB",
      "REST APIs",
      "GraphQL"
    ]
  },

  {
  "value": "homelab-virtualisation",
  "label": "Homelab",
  "image": "https://picsum.photos/405/400",
  "title": "Homelab & Virtualisation",
  "description": "In my personal homelab, I experiment with virtualisation and self-hosting to deepen my understanding of infrastructure and system administration.",
  "points": [
    "Managing a Proxmox VE server for both virtual machines and lightweight containers.",
    "Confident with Linux system administration, including managing services and users.",
    "Securing system resources and services by managing file and user permissions.",
    "Deploying and managing containerised applications for various personal projects."
  ],
  "tech": [
    "Proxmox VE",
    "Linux",
    "LXC Containers",
    "Docker",
    "Self-Hosting",
    "Networking",
    "Bash"
  ]
}

]
